Autodesk.Revit.DB.ADPInformation.URLQueryParams
Returns the properly formed and encoded query param string to pass
as part of any URL to load/embed a site that supports ADP.
Since:
2023

Autodesk.Revit.DB.ADPInformation.ProductBuildId
Returns the product build id as extracted from the executable, used in ADP (i.e. 27.0.0.0 for Revit 2027)
Since:
2023

Autodesk.Revit.DB.ADPInformation.ProductLineName
Returns the product line name.
Remarks:
Represents the name of the product line
For example RVT for Revit,  RCE for Revit Core Engine
Since:
2023

Autodesk.Revit.DB.ADPInformation.ProductName
Returns the product name.
Remarks:
The product name is typically a combination of the product line and current version.
For example  RVT2027  for revit 2027,  RCE2027 for Revit Core Engine 2027
Since:
2023